/*
 * 0000 0      0100 4      1000 8      1100 C
 * 0001 1      0101 5      1001 9      1101 D
 * 0010 2      0110 6      1010 A      1110 E
 * 0011 3      0111 7      1011 B      1111 F
 */

/**
 * 输入
 * 0101 xxxx 				x引脚设置读模式
 * 0111 xxxx 				x引脚设置写模式
 *
 * 0100 xxxx 				x引脚设置高电平
 * 0110 xxxx 				x引脚设置低电平
 *
 * 1100 xxxx				读取x引脚电平
 *
 * 1000 xxxx 				读取x引脚模拟量电平
 * 1001 xxxx yyyy yyyy		设置x引脚模拟量y电压
 */

/**
 * 输出
 * 1101 xxxx				读取的x引脚电平为高电平
 * 1100 xxxx				读取的x引脚电平为低电平
 * 1000 xxxx yyyy yyyy 		读取的x引脚为模拟量y电压
 * 0101 1001				应答 0x59
 */